[Timeout] StringLiteral
controllers/taskController.js:10:9
 
 // Create a new task
 exports.createTask = async (req, res) => {
-    log('createTask');
+    log("");
     try {
         const { title, dueDate, priority } = req.body;

[Killed] BlockStatement
controllers/taskController.js:11:9
 // Create a new task
 exports.createTask = async (req, res) => {
     log('createTask');
-    try {
-        const { title, dueDate, priority } = req.body;
-
-        if (!title || typeof title !== "string" || title.trim().length === 0) {
-            return res.status(400).json({ error: "Title is required and must be a non-empty string." });
-        }
-
-        const existingTask = await Task.findOne({ title: new RegExp(`^${title.trim()}$`, 'i') });
-        if (existingTask) {
-            return res.status(400).json({ error: "A task with this title already exists." });
-        }
-
-        if (dueDate && !moment(dueDate, moment.ISO_8601, true).isValid()) {
-            console.log("❌ Invalid dueDate rejected:", dueDate);
-            return res.status(400).json({ error: "Invalid due date format. Must be in ISO 8601 format." });
-        }
-
-        const allowedPriorities = new Set(["Low", "Medium", "High"]);
-        if (priority && !allowedPriorities.has(priority)) {
-            return res.status(400).json({ error: "Invalid priority value. Must be 'Low', 'Medium', or 'High'." });
-        }
-
-        const task = await Task.create({ ...req.body, title: title.trim() });
-        res.status(201).json(task);
-    } catch (error) {
+    try {} catch (error) {
         console.error("Error creating task:", error.message || error);
         res.status(500).json({ error: "Internal Server Error" });
killedBy: All tests
statusReason: > task-manager-api@1.0.0 test:MR
> npx playwright test tests/playwright_metamorphic.test.js --workers=1



Running 16 tests using 1 worker

[Killed] ConditionalExpression
controllers/taskController.js:14:13
     try {
         const { title, dueDate, priority } = req.body;
 
-        if (!title || typeof title !== "string" || title.trim().length === 0) {
+        if (false) {
             return res.status(400).json({ error: "Title is required and must be a non-empty string." });
         }
killedBy: All tests
statusReason: > task-manager-api@1.0.0 test:MR
> npx playwright test tests/playwright_metamorphic.test.js --workers=1



Running 16 tests using 1 worker

[Killed] ConditionalExpression
controllers/taskController.js:14:23
     try {
         const { title, dueDate, priority } = req.body;
 
-        if (!title || typeof title !== "string" || title.trim().length === 0) {
+        if (!title || false || title.trim().length === 0) {
             return res.status(400).json({ error: "Title is required and must be a non-empty string." });
         }
killedBy: All tests
statusReason: > task-manager-api@1.0.0 test:MR
> npx playwright test tests/playwright_metamorphic.test.js --workers=1



Running 16 tests using 1 worker

[Killed] ObjectLiteral
controllers/taskController.js:15:41
         const { title, dueDate, priority } = req.body;
 
         if (!title || typeof title !== "string" || title.trim().length === 0) {
-            return res.status(400).json({ error: "Title is required and must be a non-empty string." });
+            return res.status(400).json({});
         }
 
killedBy: All tests
statusReason: > task-manager-api@1.0.0 test:MR
> npx playwright test tests/playwright_metamorphic.test.js --workers=1



Running 16 tests using 1 worker

[Killed] MethodExpression
controllers/taskController.js:18:73
             return res.status(400).json({ error: "Title is required and must be a non-empty string." });
         }
 
-        const existingTask = await Task.findOne({ title: new RegExp(`^${title.trim()}$`, 'i') });
+        const existingTask = await Task.findOne({ title: new RegExp(`^${title}$`, 'i') });
         if (existingTask) {
             return res.status(400).json({ error: "A task with this title already exists." });
killedBy: All tests
statusReason: > task-manager-api@1.0.0 test:MR
> npx playwright test tests/playwright_metamorphic.test.js --workers=1



Running 16 tests using 1 worker

[Killed] ConditionalExpression
controllers/taskController.js:19:13
         }
 
         const existingTask = await Task.findOne({ title: new RegExp(`^${title.trim()}$`, 'i') });
-        if (existingTask) {
+        if (false) {
             return res.status(400).json({ error: "A task with this title already exists." });
         }
killedBy: All tests
statusReason: > task-manager-api@1.0.0 test:MR
> npx playwright test tests/playwright_metamorphic.test.js --workers=1



Running 16 tests using 1 worker

[Killed] ConditionalExpression
controllers/taskController.js:19:13
         }
 
         const existingTask = await Task.findOne({ title: new RegExp(`^${title.trim()}$`, 'i') });
-        if (existingTask) {
+        if (true) {
             return res.status(400).json({ error: "A task with this title already exists." });
         }
killedBy: All tests
statusReason: > task-manager-api@1.0.0 test:MR
> npx playwright test tests/playwright_metamorphic.test.js --workers=1



Running 16 tests using 1 worker

[Killed] ConditionalExpression
controllers/taskController.js:23:13
             return res.status(400).json({ error: "A task with this title already exists." });
         }
 
-        if (dueDate && !moment(dueDate, moment.ISO_8601, true).isValid()) {
+        if (true) {
             console.log("❌ Invalid dueDate rejected:", dueDate);
             return res.status(400).json({ error: "Invalid due date format. Must be in ISO 8601 format." });
killedBy: All tests
statusReason: > task-manager-api@1.0.0 test:MR
> npx playwright test tests/playwright_metamorphic.test.js --workers=1



Running 16 tests using 1 worker

[Killed] BooleanLiteral
controllers/taskController.js:23:24
             return res.status(400).json({ error: "A task with this title already exists." });
         }
 
-        if (dueDate && !moment(dueDate, moment.ISO_8601, true).isValid()) {
+        if (dueDate && moment(dueDate, moment.ISO_8601, true).isValid()) {
             console.log("❌ Invalid dueDate rejected:", dueDate);
             return res.status(400).json({ error: "Invalid due date format. Must be in ISO 8601 format." });
killedBy: All tests
statusReason: > task-manager-api@1.0.0 test:MR
> npx playwright test tests/playwright_metamorphic.test.js --workers=1



Running 16 tests using 1 worker

[Killed] StringLiteral
controllers/taskController.js:25:50
 
         if (dueDate && !moment(dueDate, moment.ISO_8601, true).isValid()) {
             console.log("❌ Invalid dueDate rejected:", dueDate);
-            return res.status(400).json({ error: "Invalid due date format. Must be in ISO 8601 format." });
+            return res.status(400).json({ error: "" });
         }
 
killedBy: All tests
statusReason: > task-manager-api@1.0.0 test:MR
> npx playwright test tests/playwright_metamorphic.test.js --workers=1



Running 16 tests using 1 worker

[Killed] BooleanLiteral
controllers/taskController.js:29:25
         }
 
         const allowedPriorities = new Set(["Low", "Medium", "High"]);
-        if (priority && !allowedPriorities.has(priority)) {
+        if (priority && allowedPriorities.has(priority)) {
             return res.status(400).json({ error: "Invalid priority value. Must be 'Low', 'Medium', or 'High'." });
         }
killedBy: All tests
statusReason: > task-manager-api@1.0.0 test:MR
> npx playwright test tests/playwright_metamorphic.test.js --workers=1



Running 16 tests using 1 worker

[Killed] LogicalOperator
controllers/taskController.js:29:13
         }
 
         const allowedPriorities = new Set(["Low", "Medium", "High"]);
-        if (priority && !allowedPriorities.has(priority)) {
+        if (priority || !allowedPriorities.has(priority)) {
             return res.status(400).json({ error: "Invalid priority value. Must be 'Low', 'Medium', or 'High'." });
         }
killedBy: All tests
statusReason: > task-manager-api@1.0.0 test:MR
> npx playwright test tests/playwright_metamorphic.test.js --workers=1



Running 16 tests using 1 worker

[Killed] MethodExpression
controllers/taskController.js:33:62
             return res.status(400).json({ error: "Invalid priority value. Must be 'Low', 'Medium', or 'High'." });
         }
 
-        const task = await Task.create({ ...req.body, title: title.trim() });
+        const task = await Task.create({ ...req.body, title: title });
         res.status(201).json(task);
     } catch (error) {
killedBy: All tests
statusReason: > task-manager-api@1.0.0 test:MR
> npx playwright test tests/playwright_metamorphic.test.js --workers=1



Running 16 tests using 1 worker

[Killed] BlockStatement
controllers/taskController.js:35:21
 
         const task = await Task.create({ ...req.body, title: title.trim() });
         res.status(201).json(task);
-    } catch (error) {
-        console.error("Error creating task:", error.message || error);
-        res.status(500).json({ error: "Internal Server Error" });
-    }
+    } catch (error) {}
 };
 
killedBy: All tests
statusReason: > task-manager-api@1.0.0 test:MR
> npx playwright test tests/playwright_metamorphic.test.js --workers=1



Running 16 tests using 1 worker

[Killed] ConditionalExpression
controllers/taskController.js:36:47
         const task = await Task.create({ ...req.body, title: title.trim() });
         res.status(201).json(task);
     } catch (error) {
-        console.error("Error creating task:", error.message || error);
+        console.error("Error creating task:", true);
         res.status(500).json({ error: "Internal Server Error" });
     }
killedBy: All tests
statusReason: > task-manager-api@1.0.0 test:MR
> npx playwright test tests/playwright_metamorphic.test.js --workers=1



Running 16 tests using 1 worker

[Killed] LogicalOperator
controllers/taskController.js:36:47
         const task = await Task.create({ ...req.body, title: title.trim() });
         res.status(201).json(task);
     } catch (error) {
-        console.error("Error creating task:", error.message || error);
+        console.error("Error creating task:", error.message && error);
         res.status(500).json({ error: "Internal Server Error" });
     }
killedBy: All tests
statusReason: > task-manager-api@1.0.0 test:MR
> npx playwright test tests/playwright_metamorphic.test.js --workers=1



Running 16 tests using 1 worker

[Killed] BlockStatement
controllers/taskController.js:42:40
 };
 
 // Get all tasks
-exports.getTasks = async (req, res) => {
-    log('getTasks');
-    try {
-        const tasks = await Task.find().sort({ createdAt: 1 }).lean();
-        res.status(200).json(tasks);
-    } catch (error) {
-        console.error("Error fetching tasks:", error.message || error);
-        res.status(500).json({ error: "Internal Server Error" });
-    }
-};
+exports.getTasks = async (req, res) => {};
 
 // Get a task by ID
killedBy: All tests
statusReason: > task-manager-api@1.0.0 test:MR
> npx playwright test tests/playwright_metamorphic.test.js --workers=1



Running 16 tests using 1 worker

[Killed] StringLiteral
controllers/taskController.js:43:9
 
 // Get all tasks
 exports.getTasks = async (req, res) => {
-    log('getTasks');
+    log("");
     try {
         const tasks = await Task.find().sort({ createdAt: 1 }).lean();
killedBy: All tests
statusReason: > task-manager-api@1.0.0 test:MR
> npx playwright test tests/playwright_metamorphic.test.js --workers=1



Running 16 tests using 1 worker

[Survived] BlockStatement
controllers/taskController.js:44:9
 // Get all tasks
 exports.getTasks = async (req, res) => {
     log('getTasks');
-    try {
-        const tasks = await Task.find().sort({ createdAt: 1 }).lean();
-        res.status(200).json(tasks);
-    } catch (error) {
+    try {} catch (error) {
         console.error("Error fetching tasks:", error.message || error);
         res.status(500).json({ error: "Internal Server Error" });

[Killed] MethodExpression
controllers/taskController.js:45:29
 exports.getTasks = async (req, res) => {
     log('getTasks');
     try {
-        const tasks = await Task.find().sort({ createdAt: 1 }).lean();
+        const tasks = await Task.find().lean();
         res.status(200).json(tasks);
     } catch (error) {
killedBy: All tests
statusReason: > task-manager-api@1.0.0 test:MR
> npx playwright test tests/playwright_metamorphic.test.js --workers=1



Running 16 tests using 1 worker

[Killed] BlockStatement
controllers/taskController.js:47:21
     try {
         const tasks = await Task.find().sort({ createdAt: 1 }).lean();
         res.status(200).json(tasks);
-    } catch (error) {
-        console.error("Error fetching tasks:", error.message || error);
-        res.status(500).json({ error: "Internal Server Error" });
-    }
+    } catch (error) {}
 };
 
killedBy: All tests
statusReason: > task-manager-api@1.0.0 test:MR
> npx playwright test tests/playwright_metamorphic.test.js --workers=1



Running 16 tests using 1 worker

[Killed] ConditionalExpression
controllers/taskController.js:48:48
         const tasks = await Task.find().sort({ createdAt: 1 }).lean();
         res.status(200).json(tasks);
     } catch (error) {
-        console.error("Error fetching tasks:", error.message || error);
+        console.error("Error fetching tasks:", true);
         res.status(500).json({ error: "Internal Server Error" });
     }
killedBy: All tests
statusReason: > task-manager-api@1.0.0 test:MR
> npx playwright test tests/playwright_metamorphic.test.js --workers=1



Running 16 tests using 1 worker

[Killed] LogicalOperator
controllers/taskController.js:48:48
         const tasks = await Task.find().sort({ createdAt: 1 }).lean();
         res.status(200).json(tasks);
     } catch (error) {
-        console.error("Error fetching tasks:", error.message || error);
+        console.error("Error fetching tasks:", error.message && error);
         res.status(500).json({ error: "Internal Server Error" });
     }
killedBy: All tests
statusReason: > task-manager-api@1.0.0 test:MR
> npx playwright test tests/playwright_metamorphic.test.js --workers=1



Running 16 tests using 1 worker

[Killed] ObjectLiteral
controllers/taskController.js:49:30
         res.status(200).json(tasks);
     } catch (error) {
         console.error("Error fetching tasks:", error.message || error);
-        res.status(500).json({ error: "Internal Server Error" });
+        res.status(500).json({});
     }
 };
killedBy: All tests
statusReason: > task-manager-api@1.0.0 test:MR
> npx playwright test tests/playwright_metamorphic.test.js --workers=1



Running 16 tests using 1 worker

[Killed] StringLiteral
controllers/taskController.js:49:39
         res.status(200).json(tasks);
     } catch (error) {
         console.error("Error fetching tasks:", error.message || error);
-        res.status(500).json({ error: "Internal Server Error" });
+        res.status(500).json({ error: "" });
     }
 };
killedBy: All tests
statusReason: > task-manager-api@1.0.0 test:MR
> npx playwright test tests/playwright_metamorphic.test.js --workers=1



Running 16 tests using 1 worker

[Killed] BlockStatement
controllers/taskController.js:54:43
 };
 
 // Get a task by ID
-exports.getTaskById = async (req, res) => {
-    log('getTaskById');
-    try {
-        console.log("Fetching Task with ID:", req.params.id);
-
-        if (!mongoose.Types.ObjectId.isValid(req.params.id)) {
-            console.log("🚨 Received Invalid ID:", req.params.id);
-            return res.status(400).json({ error: "Invalid task ID format." });
-        }
-
-        const task = await Task.findById(req.params.id);
-        if (!task) {
-            console.log("Task Not Found:", req.params.id);
-            return res.status(404).json({ error: "Task not found." });
-        }
-
-        console.log("Task Found:", task);
-        res.status(200).json(task);
-    } catch (error) {
-        console.error("Error in getTaskById:", error.message || error);
-        res.status(500).json({ error: "Internal Server Error" });
-    }
-};
+exports.getTaskById = async (req, res) => {};
 
 // Update a task
killedBy: All tests
statusReason: > task-manager-api@1.0.0 test:MR
> npx playwright test tests/playwright_metamorphic.test.js --workers=1



Running 16 tests using 1 worker

[Killed] StringLiteral
controllers/taskController.js:55:9
 
 // Get a task by ID
 exports.getTaskById = async (req, res) => {
-    log('getTaskById');
+    log("");
     try {
         console.log("Fetching Task with ID:", req.params.id);
killedBy: All tests
statusReason: > task-manager-api@1.0.0 test:MR
> npx playwright test tests/playwright_metamorphic.test.js --workers=1



Running 16 tests using 1 worker

[Killed] BlockStatement
controllers/taskController.js:56:9
 // Get a task by ID
 exports.getTaskById = async (req, res) => {
     log('getTaskById');
-    try {
-        console.log("Fetching Task with ID:", req.params.id);
-
-        if (!mongoose.Types.ObjectId.isValid(req.params.id)) {
-            console.log("🚨 Received Invalid ID:", req.params.id);
-            return res.status(400).json({ error: "Invalid task ID format." });
-        }
-
-        const task = await Task.findById(req.params.id);
-        if (!task) {
-            console.log("Task Not Found:", req.params.id);
-            return res.status(404).json({ error: "Task not found." });
-        }
-
-        console.log("Task Found:", task);
-        res.status(200).json(task);
-    } catch (error) {
+    try {} catch (error) {
         console.error("Error in getTaskById:", error.message || error);
         res.status(500).json({ error: "Internal Server Error" });
killedBy: All tests
statusReason: > task-manager-api@1.0.0 test:MR
> npx playwright test tests/playwright_metamorphic.test.js --workers=1



Running 16 tests using 1 worker

[Killed] BooleanLiteral
controllers/taskController.js:59:13
     try {
         console.log("Fetching Task with ID:", req.params.id);
 
-        if (!mongoose.Types.ObjectId.isValid(req.params.id)) {
+        if (mongoose.Types.ObjectId.isValid(req.params.id)) {
             console.log("🚨 Received Invalid ID:", req.params.id);
             return res.status(400).json({ error: "Invalid task ID format." });
killedBy: All tests
statusReason: > task-manager-api@1.0.0 test:MR
> npx playwright test tests/playwright_metamorphic.test.js --workers=1



Running 16 tests using 1 worker

[Killed] ConditionalExpression
controllers/taskController.js:59:13
     try {
         console.log("Fetching Task with ID:", req.params.id);
 
-        if (!mongoose.Types.ObjectId.isValid(req.params.id)) {
+        if (true) {
             console.log("🚨 Received Invalid ID:", req.params.id);
             return res.status(400).json({ error: "Invalid task ID format." });
killedBy: All tests
statusReason: > task-manager-api@1.0.0 test:MR
> npx playwright test tests/playwright_metamorphic.test.js --workers=1



Running 16 tests using 1 worker

[Killed] ObjectLiteral
controllers/taskController.js:61:41
 
         if (!mongoose.Types.ObjectId.isValid(req.params.id)) {
             console.log("🚨 Received Invalid ID:", req.params.id);
-            return res.status(400).json({ error: "Invalid task ID format." });
+            return res.status(400).json({});
         }
 
killedBy: All tests
statusReason: > task-manager-api@1.0.0 test:MR
> npx playwright test tests/playwright_metamorphic.test.js --workers=1



Running 16 tests using 1 worker

[Killed] BooleanLiteral
controllers/taskController.js:65:13
         }
 
         const task = await Task.findById(req.params.id);
-        if (!task) {
+        if (task) {
             console.log("Task Not Found:", req.params.id);
             return res.status(404).json({ error: "Task not found." });
killedBy: All tests
statusReason: > task-manager-api@1.0.0 test:MR
> npx playwright test tests/playwright_metamorphic.test.js --workers=1



Running 16 tests using 1 worker

[Killed] ConditionalExpression
controllers/taskController.js:65:13
         }
 
         const task = await Task.findById(req.params.id);
-        if (!task) {
+        if (true) {
             console.log("Task Not Found:", req.params.id);
             return res.status(404).json({ error: "Task not found." });
killedBy: All tests
statusReason: > task-manager-api@1.0.0 test:MR
> npx playwright test tests/playwright_metamorphic.test.js --workers=1



Running 16 tests using 1 worker

[Killed] ObjectLiteral
controllers/taskController.js:67:41
         const task = await Task.findById(req.params.id);
         if (!task) {
             console.log("Task Not Found:", req.params.id);
-            return res.status(404).json({ error: "Task not found." });
+            return res.status(404).json({});
         }
 
killedBy: All tests
statusReason: > task-manager-api@1.0.0 test:MR
> npx playwright test tests/playwright_metamorphic.test.js --workers=1



Running 16 tests using 1 worker

[Survived] StringLiteral
controllers/taskController.js:67:50
         const task = await Task.findById(req.params.id);
         if (!task) {
             console.log("Task Not Found:", req.params.id);
-            return res.status(404).json({ error: "Task not found." });
+            return res.status(404).json({ error: "" });
         }
 

[Killed] BlockStatement
controllers/taskController.js:72:21
 
         console.log("Task Found:", task);
         res.status(200).json(task);
-    } catch (error) {
-        console.error("Error in getTaskById:", error.message || error);
-        res.status(500).json({ error: "Internal Server Error" });
-    }
+    } catch (error) {}
 };
 
killedBy: All tests
statusReason: > task-manager-api@1.0.0 test:MR
> npx playwright test tests/playwright_metamorphic.test.js --workers=1



Running 16 tests using 1 worker

[Killed] ConditionalExpression
controllers/taskController.js:73:48
         console.log("Task Found:", task);
         res.status(200).json(task);
     } catch (error) {
-        console.error("Error in getTaskById:", error.message || error);
+        console.error("Error in getTaskById:", true);
         res.status(500).json({ error: "Internal Server Error" });
     }
killedBy: All tests
statusReason: > task-manager-api@1.0.0 test:MR
> npx playwright test tests/playwright_metamorphic.test.js --workers=1



Running 16 tests using 1 worker

[Killed] LogicalOperator
controllers/taskController.js:73:48
         console.log("Task Found:", task);
         res.status(200).json(task);
     } catch (error) {
-        console.error("Error in getTaskById:", error.message || error);
+        console.error("Error in getTaskById:", error.message && error);
         res.status(500).json({ error: "Internal Server Error" });
     }
killedBy: All tests
statusReason: > task-manager-api@1.0.0 test:MR
> npx playwright test tests/playwright_metamorphic.test.js --workers=1



Running 16 tests using 1 worker

[Killed] ConditionalExpression
controllers/taskController.js:82:13
 exports.updateTask = async (req, res) => {
     log('updateTask');
     try {
-        if (!mongoose.Types.ObjectId.isValid(req.params.id)) {
+        if (false) {
             console.log("🚨 Received Invalid ID:", req.params.id);
             return res.status(400).json({ error: "Invalid task ID format." });
killedBy: All tests
statusReason: > task-manager-api@1.0.0 test:MR
> npx playwright test tests/playwright_metamorphic.test.js --workers=1



Running 16 tests using 1 worker

[Killed] BooleanLiteral
controllers/taskController.js:82:13
 exports.updateTask = async (req, res) => {
     log('updateTask');
     try {
-        if (!mongoose.Types.ObjectId.isValid(req.params.id)) {
+        if (mongoose.Types.ObjectId.isValid(req.params.id)) {
             console.log("🚨 Received Invalid ID:", req.params.id);
             return res.status(400).json({ error: "Invalid task ID format." });
killedBy: All tests
statusReason: > task-manager-api@1.0.0 test:MR
> npx playwright test tests/playwright_metamorphic.test.js --workers=1



Running 16 tests using 1 worker

[Killed] ConditionalExpression
controllers/taskController.js:88:13
         }
 
         const task = await Task.findById(req.params.id);
-        if (!task) {
+        if (false) {
             return res.status(404).json({ error: "Task not found." });
         }
killedBy: All tests
statusReason: > task-manager-api@1.0.0 test:MR
> npx playwright test tests/playwright_metamorphic.test.js --workers=1



Running 16 tests using 1 worker

[Killed] ConditionalExpression
controllers/taskController.js:95:13
         const { priority, dueDate } = req.body;
         const allowedPriorities = new Set(["Low", "Medium", "High"]);
 
-        if (priority && !allowedPriorities.has(priority)) {
+        if (false) {
             return res.status(400).json({ error: "Invalid priority value. Must be 'Low', 'Medium', or 'High'." });
         }
killedBy: All tests
statusReason: > task-manager-api@1.0.0 test:MR
> npx playwright test tests/playwright_metamorphic.test.js --workers=1



Running 16 tests using 1 worker

[Killed] LogicalOperator
controllers/taskController.js:95:13
         const { priority, dueDate } = req.body;
         const allowedPriorities = new Set(["Low", "Medium", "High"]);
 
-        if (priority && !allowedPriorities.has(priority)) {
+        if (priority || !allowedPriorities.has(priority)) {
             return res.status(400).json({ error: "Invalid priority value. Must be 'Low', 'Medium', or 'High'." });
         }
killedBy: All tests
statusReason: > task-manager-api@1.0.0 test:MR
> npx playwright test tests/playwright_metamorphic.test.js --workers=1



Running 16 tests using 1 worker

[Killed] StringLiteral
controllers/taskController.js:96:50
         const allowedPriorities = new Set(["Low", "Medium", "High"]);
 
         if (priority && !allowedPriorities.has(priority)) {
-            return res.status(400).json({ error: "Invalid priority value. Must be 'Low', 'Medium', or 'High'." });
+            return res.status(400).json({ error: "" });
         }
 
killedBy: All tests
statusReason: > task-manager-api@1.0.0 test:MR
> npx playwright test tests/playwright_metamorphic.test.js --workers=1



Running 16 tests using 1 worker

[Killed] LogicalOperator
controllers/taskController.js:99:13
             return res.status(400).json({ error: "Invalid priority value. Must be 'Low', 'Medium', or 'High'." });
         }
 
-        if (dueDate && !moment(dueDate, moment.ISO_8601, true).isValid()) {
+        if (dueDate || !moment(dueDate, moment.ISO_8601, true).isValid()) {
             return res.status(400).json({ error: "Invalid due date format. Must be in ISO 8601 format." });
         }
killedBy: All tests
statusReason: > task-manager-api@1.0.0 test:MR
> npx playwright test tests/playwright_metamorphic.test.js --workers=1



Running 16 tests using 1 worker

[Killed] ConditionalExpression
controllers/taskController.js:99:13
             return res.status(400).json({ error: "Invalid priority value. Must be 'Low', 'Medium', or 'High'." });
         }
 
-        if (dueDate && !moment(dueDate, moment.ISO_8601, true).isValid()) {
+        if (false) {
             return res.status(400).json({ error: "Invalid due date format. Must be in ISO 8601 format." });
         }
killedBy: All tests
statusReason: > task-manager-api@1.0.0 test:MR
> npx playwright test tests/playwright_metamorphic.test.js --workers=1



Running 16 tests using 1 worker

[Killed] BlockStatement
controllers/taskController.js:103:29
             return res.status(400).json({ error: "Invalid due date format. Must be in ISO 8601 format." });
         }
 
-        if (req.body.title) {
-            req.body.title = req.body.title.trim();
-        }
+        if (req.body.title) {}
 
         const updatedTask = await Task.findByIdAndUpdate(req.params.id, req.body, { new: true });
killedBy: All tests
statusReason: > task-manager-api@1.0.0 test:MR
> npx playwright test tests/playwright_metamorphic.test.js --workers=1



Running 16 tests using 1 worker

[Killed] ConditionalExpression
controllers/taskController.js:103:13
             return res.status(400).json({ error: "Invalid due date format. Must be in ISO 8601 format." });
         }
 
-        if (req.body.title) {
+        if (false) {
             req.body.title = req.body.title.trim();
         }
killedBy: All tests
statusReason: > task-manager-api@1.0.0 test:MR
> npx playwright test tests/playwright_metamorphic.test.js --workers=1



Running 16 tests using 1 worker

[Killed] MethodExpression
controllers/taskController.js:104:30
         }
 
         if (req.body.title) {
-            req.body.title = req.body.title.trim();
+            req.body.title = req.body.title;
         }
 
killedBy: All tests
statusReason: > task-manager-api@1.0.0 test:MR
> npx playwright test tests/playwright_metamorphic.test.js --workers=1



Running 16 tests using 1 worker

[Survived] BooleanLiteral
controllers/taskController.js:107:90
             req.body.title = req.body.title.trim();
         }
 
-        const updatedTask = await Task.findByIdAndUpdate(req.params.id, req.body, { new: true });
+        const updatedTask = await Task.findByIdAndUpdate(req.params.id, req.body, { new: false });
         if (!updatedTask) {
             return res.status(500).json({ error: "Task update failed." });
