[Killed] BlockStatement
controllers/taskController.js:108:27
         }
 
         const updatedTask = await Task.findByIdAndUpdate(req.params.id, req.body, { new: true });
-        if (!updatedTask) {
-            return res.status(500).json({ error: "Task update failed." });
-        }
+        if (!updatedTask) {}
 
         res.status(200).json(updatedTask);
killedBy: All tests
statusReason: > task-manager-api@1.0.0 test:MR
> npx playwright test tests/playwright_metamorphic.test.js --workers=1



Running 16 tests using 1 worker

[Killed] ConditionalExpression
controllers/taskController.js:108:13
         }
 
         const updatedTask = await Task.findByIdAndUpdate(req.params.id, req.body, { new: true });
-        if (!updatedTask) {
+        if (false) {
             return res.status(500).json({ error: "Task update failed." });
         }
killedBy: All tests
statusReason: > task-manager-api@1.0.0 test:MR
> npx playwright test tests/playwright_metamorphic.test.js --workers=1



Running 16 tests using 1 worker

[Killed] StringLiteral
controllers/taskController.js:109:50
 
         const updatedTask = await Task.findByIdAndUpdate(req.params.id, req.body, { new: true });
         if (!updatedTask) {
-            return res.status(500).json({ error: "Task update failed." });
+            return res.status(500).json({ error: "" });
         }
 
killedBy: All tests
statusReason: > task-manager-api@1.0.0 test:MR
> npx playwright test tests/playwright_metamorphic.test.js --workers=1



Running 16 tests using 1 worker

[Killed] BlockStatement
controllers/taskController.js:113:21
         }
 
         res.status(200).json(updatedTask);
-    } catch (error) {
-        console.error("Error updating task:", error.message || error);
-        res.status(500).json({ error: "Internal Server Error" });
-    }
+    } catch (error) {}
 };
 
killedBy: All tests
statusReason: > task-manager-api@1.0.0 test:MR
> npx playwright test tests/playwright_metamorphic.test.js --workers=1



Running 16 tests using 1 worker

[Killed] ConditionalExpression
controllers/taskController.js:114:47
 
         res.status(200).json(updatedTask);
     } catch (error) {
-        console.error("Error updating task:", error.message || error);
+        console.error("Error updating task:", true);
         res.status(500).json({ error: "Internal Server Error" });
     }
killedBy: All tests
statusReason: > task-manager-api@1.0.0 test:MR
> npx playwright test tests/playwright_metamorphic.test.js --workers=1



Running 16 tests using 1 worker

[Survived] LogicalOperator
controllers/taskController.js:114:47
 
         res.status(200).json(updatedTask);
     } catch (error) {
-        console.error("Error updating task:", error.message || error);
+        console.error("Error updating task:", error.message && error);
         res.status(500).json({ error: "Internal Server Error" });
     }

[Survived] StringLiteral
controllers/taskController.js:115:39
         res.status(200).json(updatedTask);
     } catch (error) {
         console.error("Error updating task:", error.message || error);
-        res.status(500).json({ error: "Internal Server Error" });
+        res.status(500).json({ error: "" });
     }
 };

[Killed] BlockStatement
controllers/taskController.js:120:42
 };
 
 // Delete a task
-exports.deleteTask = async (req, res) => {
-    log('deleteTask');
-    try {
-        if (!mongoose.Types.ObjectId.isValid(req.params.id)) {
-            console.log("🚨 Received Invalid ID:", req.params.id);
-            return res.status(400).json({ error: "Invalid task ID format." });
-        }
-
-        const task = await Task.findById(req.params.id);
-        if (!task) {
-            return res.status(404).json({ error: "Task not found." });
-        }
-
-        await Task.findByIdAndDelete(req.params.id);
-        res.status(204).send();
-        console.log("🔥 deleteTask logic hit");
-    } catch (error) {
-        console.error("Error deleting task:", error.message || error);
-        res.status(500).json({ error: "Internal Server Error" });
-    }
-};
+exports.deleteTask = async (req, res) => {};
 
 // Delete all tasks
killedBy: All tests
statusReason: > task-manager-api@1.0.0 test:MR
> npx playwright test tests/playwright_metamorphic.test.js --workers=1



Running 16 tests using 1 worker

[Survived] BlockStatement
controllers/taskController.js:122:9
 // Delete a task
 exports.deleteTask = async (req, res) => {
     log('deleteTask');
-    try {
-        if (!mongoose.Types.ObjectId.isValid(req.params.id)) {
-            console.log("🚨 Received Invalid ID:", req.params.id);
-            return res.status(400).json({ error: "Invalid task ID format." });
-        }
-
-        const task = await Task.findById(req.params.id);
-        if (!task) {
-            return res.status(404).json({ error: "Task not found." });
-        }
-
-        await Task.findByIdAndDelete(req.params.id);
-        res.status(204).send();
-        console.log("🔥 deleteTask logic hit");
-    } catch (error) {
+    try {} catch (error) {
         console.error("Error deleting task:", error.message || error);
         res.status(500).json({ error: "Internal Server Error" });

[Killed] BlockStatement
controllers/taskController.js:123:62
 exports.deleteTask = async (req, res) => {
     log('deleteTask');
     try {
-        if (!mongoose.Types.ObjectId.isValid(req.params.id)) {
-            console.log("🚨 Received Invalid ID:", req.params.id);
-            return res.status(400).json({ error: "Invalid task ID format." });
-        }
+        if (!mongoose.Types.ObjectId.isValid(req.params.id)) {}
 
         const task = await Task.findById(req.params.id);
killedBy: All tests
statusReason: > task-manager-api@1.0.0 test:MR
> npx playwright test tests/playwright_metamorphic.test.js --workers=1



Running 16 tests using 1 worker

[Killed] BlockStatement
controllers/taskController.js:129:20
         }
 
         const task = await Task.findById(req.params.id);
-        if (!task) {
-            return res.status(404).json({ error: "Task not found." });
-        }
+        if (!task) {}
 
         await Task.findByIdAndDelete(req.params.id);
killedBy: All tests
statusReason: > task-manager-api@1.0.0 test:MR
> npx playwright test tests/playwright_metamorphic.test.js --workers=1



Running 16 tests using 1 worker

[Survived] StringLiteral
controllers/taskController.js:135:21
 
         await Task.findByIdAndDelete(req.params.id);
         res.status(204).send();
-        console.log("🔥 deleteTask logic hit");
+        console.log("";
     } catch (error) {
         console.error("Error deleting task:", error.message || error);

[Killed] BlockStatement
controllers/taskController.js:136:21
         await Task.findByIdAndDelete(req.params.id);
         res.status(204).send();
         console.log("🔥 deleteTask logic hit");
-    } catch (error) {
-        console.error("Error deleting task:", error.message || error);
-        res.status(500).json({ error: "Internal Server Error" });
-    }
+    } catch (error) {}
 };
 
killedBy: All tests
statusReason: > task-manager-api@1.0.0 test:MR
> npx playwright test tests/playwright_metamorphic.test.js --workers=1



Running 16 tests using 1 worker

[Killed] ConditionalExpression
controllers/taskController.js:137:47
         res.status(204).send();
         console.log("🔥 deleteTask logic hit");
     } catch (error) {
-        console.error("Error deleting task:", error.message || error);
+        console.error("Error deleting task:", false);
         res.status(500).json({ error: "Internal Server Error" });
     }
killedBy: All tests
statusReason: > task-manager-api@1.0.0 test:MR
> npx playwright test tests/playwright_metamorphic.test.js --workers=1



Running 16 tests using 1 worker

[Killed] LogicalOperator
controllers/taskController.js:137:47
         res.status(204).send();
         console.log("🔥 deleteTask logic hit");
     } catch (error) {
-        console.error("Error deleting task:", error.message || error);
+        console.error("Error deleting task:", error.message && error);
         res.status(500).json({ error: "Internal Server Error" });
     }
killedBy: All tests
statusReason: > task-manager-api@1.0.0 test:MR
> npx playwright test tests/playwright_metamorphic.test.js --workers=1



Running 16 tests using 1 worker

[Killed] StringLiteral
controllers/taskController.js:138:39
         console.log("🔥 deleteTask logic hit");
     } catch (error) {
         console.error("Error deleting task:", error.message || error);
-        res.status(500).json({ error: "Internal Server Error" });
+        res.status(500).json({ error: "" });
     }
 };
killedBy: All tests
statusReason: > task-manager-api@1.0.0 test:MR
> npx playwright test tests/playwright_metamorphic.test.js --workers=1



Running 16 tests using 1 worker

[Survived] BlockStatement
controllers/taskController.js:143:46
 };
 
 // Delete all tasks
-exports.deleteAllTasks = async (req, res) => {
-    log('deleteAllTasks');
-    try {
-        console.log("Deleting all tasks...");
-        await Task.deleteMany({});
-        res.status(204).send();
-        console.log("🔥 deleteAllTasks logic hit");
-    } catch (error) {
-        console.error("Error deleting all tasks:", error.message || error);
-        res.status(500).json({ error: "Internal Server Error" });
-    }
-};
+exports.deleteAllTasks = async (req, res) => {};

[Survived] StringLiteral
controllers/taskController.js:144:9
 
 // Delete all tasks
 exports.deleteAllTasks = async (req, res) => {
-    log('deleteAllTasks');
+    log("");
     try {
         console.log("Deleting all tasks...");

[Killed] BlockStatement
controllers/taskController.js:145:9
 // Delete all tasks
 exports.deleteAllTasks = async (req, res) => {
     log('deleteAllTasks');
-    try {
-        console.log("Deleting all tasks...");
-        await Task.deleteMany({});
-        res.status(204).send();
-        console.log("🔥 deleteAllTasks logic hit");
-    } catch (error) {
+    try {} catch (error) {
         console.error("Error deleting all tasks:", error.message || error);
         res.status(500).json({ error: "Internal Server Error" });
killedBy: All tests
statusReason: > task-manager-api@1.0.0 test:MR
> npx playwright test tests/playwright_metamorphic.test.js --workers=1



Running 16 tests using 1 worker

[Killed] BlockStatement
controllers/taskController.js:150:21
         await Task.deleteMany({});
         res.status(204).send();
         console.log("🔥 deleteAllTasks logic hit");
-    } catch (error) {
-        console.error("Error deleting all tasks:", error.message || error);
-        res.status(500).json({ error: "Internal Server Error" });
-    }
+    } catch (error) {}
 };
killedBy: All tests
statusReason: > task-manager-api@1.0.0 test:MR
> npx playwright test tests/playwright_metamorphic.test.js --workers=1



Running 16 tests using 1 worker

[Killed] LogicalOperator
controllers/taskController.js:151:52
         res.status(204).send();
         console.log("🔥 deleteAllTasks logic hit");
     } catch (error) {
-        console.error("Error deleting all tasks:", error.message || error);
+        console.error("Error deleting all tasks:", error.message && error);
         res.status(500).json({ error: "Internal Server Error" });
     }
killedBy: All tests
statusReason: > task-manager-api@1.0.0 test:MR
> npx playwright test tests/playwright_metamorphic.test.js --workers=1



Running 16 tests using 1 worker

[Killed] ConditionalExpression
controllers/taskController.js:151:52
         res.status(204).send();
         console.log("🔥 deleteAllTasks logic hit");
     } catch (error) {
-        console.error("Error deleting all tasks:", error.message || error);
+        console.error("Error deleting all tasks:", false);
         res.status(500).json({ error: "Internal Server Error" });
     }
killedBy: All tests
statusReason: > task-manager-api@1.0.0 test:MR
> npx playwright test tests/playwright_metamorphic.test.js --workers=1



Running 16 tests using 1 worker

[Survived] StringLiteral
controllers/taskController.js:152:39
         console.log("🔥 deleteAllTasks logic hit");
     } catch (error) {
         console.error("Error deleting all tasks:", error.message || error);
-        res.status(500).json({ error: "Internal Server Error" });
+        res.status(500).json({ error: "" });
     }
 };
