[Killed] BlockStatement
controllers/taskController.js:19:27
         }
 
         const existingTask = await Task.findOne({ title: new RegExp(`^${title.trim()}$`, 'i') });
-        if (existingTask) {
-            return res.status(400).json({ error: "A task with this title already exists." });
-        }
+        if (existingTask) {}
 
         if (dueDate && !moment(dueDate, moment.ISO_8601, true).isValid()) {
killedBy: All tests
statusReason: > task-manager-api@1.0.0 test:MR
> npx playwright test tests/playwright_metamorphic.test.js --workers=1



Running 13 tests using 1 worker

[Killed] BlockStatement
controllers/taskController.js:29:59
         }
 
         const allowedPriorities = new Set(["Low", "Medium", "High"]);
-        if (priority && !allowedPriorities.has(priority)) {
-            return res.status(400).json({ error: "Invalid priority value. Must be 'Low', 'Medium', or 'High'." });
-        }
+        if (priority && !allowedPriorities.has(priority)) {}
 
         const task = await Task.create({ ...req.body, title: title.trim() });
killedBy: All tests
statusReason: > task-manager-api@1.0.0 test:MR
> npx playwright test tests/playwright_metamorphic.test.js --workers=1



Running 13 tests using 1 worker

[Killed] BlockStatement
controllers/taskController.js:59:62
     try {
         console.log("Fetching Task with ID:", req.params.id);
 
-        if (!mongoose.Types.ObjectId.isValid(req.params.id)) {
-            console.log("🚨 Received Invalid ID:", req.params.id);
-            return res.status(400).json({ error: "Invalid task ID format." });
-        }
+        if (!mongoose.Types.ObjectId.isValid(req.params.id)) {}
 
         const task = await Task.findById(req.params.id);
killedBy: All tests
statusReason: > task-manager-api@1.0.0 test:MR
> npx playwright test tests/playwright_metamorphic.test.js --workers=1



Running 13 tests using 1 worker

[Killed] ConditionalExpression
controllers/taskController.js:82:13
 exports.updateTask = async (req, res) => {
     log('updateTask');
     try {
-        if (!mongoose.Types.ObjectId.isValid(req.params.id)) {
+        if (true) {
             console.log("🚨 Received Invalid ID:", req.params.id);
             return res.status(400).json({ error: "Invalid task ID format." });
killedBy: All tests
statusReason: > task-manager-api@1.0.0 test:MR
> npx playwright test tests/playwright_metamorphic.test.js --workers=1



Running 13 tests using 1 worker

[Killed] BlockStatement
controllers/taskController.js:95:59
         const { priority, dueDate } = req.body;
         const allowedPriorities = new Set(["Low", "Medium", "High"]);
 
-        if (priority && !allowedPriorities.has(priority)) {
-            return res.status(400).json({ error: "Invalid priority value. Must be 'Low', 'Medium', or 'High'." });
-        }
+        if (priority && !allowedPriorities.has(priority)) {}
 
         if (dueDate && !moment(dueDate, moment.ISO_8601, true).isValid()) {
killedBy: All tests
statusReason: > task-manager-api@1.0.0 test:MR
> npx playwright test tests/playwright_metamorphic.test.js --workers=1



Running 13 tests using 1 worker

[Killed] ConditionalExpression
controllers/taskController.js:103:13
             return res.status(400).json({ error: "Invalid due date format. Must be in ISO 8601 format." });
         }
 
-        if (req.body.title) {
+        if (true) {
             req.body.title = req.body.title.trim();
         }
killedBy: All tests
statusReason: > task-manager-api@1.0.0 test:MR
> npx playwright test tests/playwright_metamorphic.test.js --workers=1



Running 13 tests using 1 worker

[Survived] ConditionalExpression
controllers/taskController.js:137:47
         res.status(204).send();
         console.log("🔥 deleteTask logic hit");
     } catch (error) {
-        console.error("Error deleting task:", error.message || error);
+        console.error("Error deleting task:", true);
         res.status(500).json({ error: "Internal Server Error" });
     }

[Killed] ConditionalExpression
controllers/taskController.js:151:52
         res.status(204).send();
         console.log("🔥 deleteAllTasks logic hit");
     } catch (error) {
-        console.error("Error deleting all tasks:", error.message || error);
+        console.error("Error deleting all tasks:", true);
         res.status(500).json({ error: "Internal Server Error" });
     }
killedBy: All tests
statusReason: > task-manager-api@1.0.0 test:MR
> npx playwright test tests/playwright_metamorphic.test.js --workers=1



Running 13 tests using 1 worker
